.doom.d/config.el

(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))

;; (defun vulpea-project-p ()
;;   "Return non-nil if current buffer has any todo entry.
;;     TODO entries marked as done are ignored, meaning the this
;;     function returns nil if current buffer contains only completed
;;     tasks."
;;   (seq-find                                 ; (3)
;;    (lambda (type)
;;      (eq type 'todo))
;;    (org-element-map                         ; (2)
;;        (org-element-parse-buffer 'headline) ; (1)
;;        'headline
;;      (lambda (h)
;;        (org-element-property :todo-type h)))))

;; (defun vulpea-project-update-tag ()
;;     "Update PROJECT tag in the current buffer."
;;     (when (and (not (active-minibuffer-window))
;;                (vulpea-buffer-p))
;;       (save-excursion
;;         (goto-char (point-min))
;;         (let* ((tags (vulpea-buffer-tags-get))
;;                (original-tags tags))
;;           (if (vulpea-project-p)
;;               (setq tags (cons "project" tags))
;;             (setq tags (remove "project" tags)))

;;           ;; cleanup duplicates
;;           (setq tags (seq-uniq tags))

;;           ;; update tags if changed
;;           (when (or (seq-difference tags original-tags)
;;                     (seq-difference original-tags tags))
;;             (apply #'vulpea-buffer-tags-set tags))))))

;; (defun vulpea-buffer-p ()
;;   "Return non-nil if the currently visited buffer is a note."
;;   (and buffer-file-name
;;        (string-prefix-p
;;         (expand-file-name (file-name-as-directory org-roam-directory))
;;         (file-name-directory buffer-file-name))))

(defun vulpea-project-files ()
    "Return a list of note files containing 'project' tag." ;
    (seq-uniq
     (seq-map
      #'car
      (org-roam-db-query
       [:select [nodes:file]
        :from tags
        :left-join nodes
        :on (= tags:node-id nodes:id)
        :where (like tag (quote "%\"project\"%"))]))))

(defun vulpea-agenda-files-update (&rest _)
  "Update the value of `org-agenda-files'."
  (setq org-agenda-files (vulpea-project-files)))

;; (add-hook 'find-file-hook #'vulpea-project-update-tag)
;; (add-hook 'before-save-hook #'vulpea-project-update-tag)

(advice-add 'org-agenda :before #'vulpea-agenda-files-update)
(advice-add 'org-todo-list :before #'vulpea-agenda-files-update)

(use-package! org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  (org-roam-directory "~/Documents/org/notes")
  (org-roam-dailies-directory "journal/")
  (org-roam-completion-everywhere t)
  (org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("l" "programming language" plain
      "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("b" "book notes" plain
      "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("w" "work-project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Docs\n\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: project")
      :unnarrowed t)
     ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: project")
      :unnarrowed t)))
  :bind (:map org-mode-map
         ("C-M-i" . completion-at-point))
  :config
  (org-roam-setup)
  (require 'org-roam-dailies) ;; Ensure the keymap is available
  (org-roam-db-autosync-mode)

(map! :leader
      (:prefix ("n" . "notes")
       :desc "Insert-Node-Immediate" "r I" #'org-roam-node-insert-immediate)))

(setq org-journal-dir "~/Documents/org/journal/"
      org-journal-file-format "%Y-%m-%d.org")
;;function to create journal based on template
(defun pc/new-buffer-p ()
    (not (file-exists-p (buffer-file-name))))

  (defun pc/insert-journal-template ()
    (let ((template-file (expand-file-name "journal-template.org" org-directory)))
      (when (pc/new-buffer-p)
        (save-excursion
          (goto-char (point-max))
          (insert-file-contents template-file)))))

  (add-hook 'org-journal-after-entry-create-hook #'pc/insert-journal-template)

(setq max-specpdl-size 13000)

(setq display-line-numbers-type t)
(map! :leader
      :desc "Comment or uncomment lines" "TAB TAB" #'comment-line
      (:prefix ("t" . "toggle")
       :desc "Toggle line numbers" "l" #'doom/toggle-line-numbers
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle truncate lines" "t" #'toggle-truncate-lines))





(defun my-projectile-project-find-function (dir)
  (let ((root (projectile-project-root dir)))
    (and root (cons 'transient root))))

(projectile-mode t)

(with-eval-after-load 'project
  (add-to-list 'project-find-functions 'my-projectile-project-find-function))

;; (add-to-list 'eglot-server-programs '((c++-mode c-mode) "clangd"))
(add-hook 'c-mode-hook 'eglot-ensure)
(add-hook 'c++-mode-hook 'eglot-ensure)

;;(setq lsp-bridge-path (concat straight-base-dir "straight/repos/lsp-bridge"))
;;(add-to-list 'load-path lsp-bridge-path)
;; (add-to-list 'load-path "/home/zhicheng/.emacs.d/.local/straight/repos/lsp-bridge")
;; (require 'posframe)
;; (require 'yasnippet)
;; (yas-global-mode 1)

;; (require 'lsp-bridge)
;; (global-lsp-bridge-mode)
;; (setq lsp-bridge-c-lsp-server "ccls"
;;       acm-enable-english-helper nil)

(setq shell-file-name "/bin/zsh"
      vterm-max-scrollback 5000)
(map! :leader
      :desc "Vterm popup toggle" "v t" #'+vterm/toggle)

;; (setq tramp-shell-prompt-pattern  "[-a-z0-9]+{[a-z0-9]+}[0-9]+: *")
(setq tramp-shell-prompt-pattern       "\\(?:^\\|\r\\)[^]#$%>\n]*#?[]#$%>].* *\\(^[\\[[0-9;]*[a-zA-Z] *\\)*")
(setq tramp-terminal-type       "xterm")
(eval-after-load 'tramp '(setenv "SHELL" "/usr/bin/bash"))
(setq tramp-encoding-shell "/usr/bin/bash")
(setq tramp-verbose 10)
;; (add-to-list 'tramp-remote-path 'tramp-own-remote-path)
;; (add-to-list 'tramp-remote-path "/usr/bin")
